sulaolab/dspic33ak-hal-starter/src/app/tdm_smoke.c
/*
 * tdm_smoke.c  --  codec-less SPI1 TDM master smoke demo (see tdm_smoke.h)
 *
 * Default geometry is TDM8. A hidden project config (conf.h) may opt into wider
 * experimental framing for scope checks; this file is slots-generic and follows it.
 *
 * Design notes:
 *  - The block callback runs in DMA-ISR context. It does ONLY the TX block fill and a
 *    light RX energy accumulator. No printf/sqrtf/log10f/formatting here.
 *  - RX level: each RX sample is right-shifted before squaring and summed into a 64-bit
 *    per-block accumulator (no long accumulation of raw Q31^2 -> no overflow). The dB
 *    conversion (log10f) happens in tdm_smoke_status_print(), i.e. main-loop context.
 *  - TX sine amplitude is near-full-scale but never INT32_MIN (0x70000000).
 *  - fs/bclk shown in the status line are EXPECTED (design) values, not measurements.
 */

#include "tdm_smoke.h"
#include "app_config.h"

#if HAL_STARTER_ENABLE_TDM_SMOKE_DEMO
/* When the demo is disabled (app_config.h) this whole translation unit compiles to
 * nothing -- so the sinf/log10f and HAL dependencies are dropped from the OFF build.
 * main.c also guards its calls on the same macro, so there is nothing to link. */

#include <stdio.h>
#include <stdint.h>
#include <math.h>

#include "starter_clock.h"                 // STARTER_CLOCK_SYS_HZ (SPI1 baud clock src)
#include "nora_dma.h"                 // nora_dma_global_init()
#include "nora_spi_i2s_tdm.h"         // transport HAL public API
#include "nora_spi_i2s_tdm_conf.h"    // NORA_TDM_SLOTS_PER_FS / _BLOCK_FRAMES
#include "board.h"                         // board_spi1_tdm_smoke_pins_init()
#if (APP_TDM_MASTER_FS50_BY_CLC10 && APP_TDM_FS_RUNTIME_SWITCH_TEST)
#include <xc.h>                            // RPOR17bits.RP70R readback for the FS-pin restore self-test
#endif

//===========================================================
// Demo constants
//===========================================================
// Target TDM frame rate (Hz). Exact value is not important -- the demo only needs a
// visible TDM waveform. BCLK = SYS / (2*(BRG+1)); target BCLK = slots * 32 * fs.
//   BRG = SYS / (2 * slots * 32 * fs) - 1.
//   200 MHz / (2*8*32*48000) - 1 = 7  -> BCLK 12.5 MHz, fs ~48.8 kHz (expected, not exact).
#define TDM_SMOKE_TARGET_FS_HZ   (48000u)
// NOTE: valid only while the target BCLK (slots*32*fs) <= SYS/2, i.e. the divisor >= 1. For the
// shipping demo geometries this holds (TDM8/48k -> BRG 7, TDM16 -> 3). A much larger slots*fs
// would drive the divisor below 1 and the "- 1" would underflow to a huge BRG -- the
// _Static_assert below turns that misconfiguration into a build failure instead of a runtime
// surprise. The arithmetic is done in uint64_t so the intermediate slots*32*fs cannot overflow.
#define TDM_SMOKE_SPI_BRG \
    ((uint32_t)(((uint64_t)STARTER_CLOCK_SYS_HZ / \
                 (2ull * (uint64_t)NORA_TDM_SLOTS_PER_FS * 32ull * (uint64_t)TDM_SMOKE_TARGET_FS_HZ)) - 1ull))
// Build-fail (not just comment) if the requested BCLK exceeds the available SPI clock: the divisor
// would be < 1 and the "- 1" underflow to a huge BRG. All operands are compile-time constants.
_Static_assert(
    (uint64_t)STARTER_CLOCK_SYS_HZ >=
        (2ull * (uint64_t)NORA_TDM_SLOTS_PER_FS * 32ull * (uint64_t)TDM_SMOKE_TARGET_FS_HZ),
    "TDM_SMOKE: requested BCLK (slots*32*fs) exceeds the SPI clock; SPI_BRG would underflow -- "
    "lower TDM_SMOKE_TARGET_FS_HZ or the slot count." );
// Expected (design) BCLK and frame rate from the resolved BRG/geometry -- printed in the
// status line so it stays correct across TDM8 (BRG=7, ~12.5 MHz) and TDM16 (BRG=3, ~25 MHz).
#define TDM_SMOKE_EXP_BCLK_HZ \
    (STARTER_CLOCK_SYS_HZ / (2u * (TDM_SMOKE_SPI_BRG + 1u)))
#define TDM_SMOKE_EXP_FS_HZ \
    (TDM_SMOKE_EXP_BCLK_HZ / ((uint32_t)NORA_TDM_SLOTS_PER_FS * 32u))

// Sine lookup table: power-of-two length so the per-frame index step is a cheap mask.
// 64 samples/cycle at fs ~48.8 kHz -> ~763 Hz (an "~800 Hz class" tone).
#define TDM_SMOKE_LUT_N          (64u)
#define TDM_SMOKE_LUT_MASK       (TDM_SMOKE_LUT_N - 1u)
#define TDM_SMOKE_AMPLITUDE      (0x70000000)   // near-full-scale Q31, never INT32_MIN
#define TDM_SMOKE_RX_FLOOR_DB    (-140.0f)

//===========================================================
// State
//===========================================================
static int32_t  s_sine_lut[TDM_SMOKE_LUT_N];
static float    s_tx_ref_meansq;            // mean-square of (lut>>16), the 0 dB reference
static bool     s_started;
static bool     s_paused_for_update;
static nora_spi_i2s_tdm_error_t s_init_error = NORA_SPI_I2S_TDM_ERR_NONE;

// Published by the block callback (debug aid). Read non-atomically from the main loop: on this
// 16-bit core a 64-bit read may TEAR against the ISR's update, so a single status line's dB can
// be momentarily inaccurate. This is display only -- transport control does not depend on it.
static volatile uint32_t s_phase;           // frame phase into the sine LUT
static volatile uint64_t s_rx_sumsq;        // last block: sum of (rx>>16)^2
static volatile uint32_t s_rx_count;        // last block: sample count

//===========================================================
// Block callback (DMA-ISR context) -- TX fill + light RX accumulator ONLY
//===========================================================
static void tdm_smoke_block_cb(const int32_t *src, int32_t *dst, void *user)
{
    (void)user;
    const uint32_t slots  = (uint32_t)NORA_TDM_SLOTS_PER_FS;
    const uint32_t frames = (uint32_t)NORA_TDM_BLOCK_FRAMES;
    uint32_t       phase  = s_phase;
    uint64_t       sumsq  = 0u;
    uint32_t       w      = 0u;

    // Frame-major buffer: [f0 s0..s7][f1 s0..s7]... All 8 slots of a frame get the same
    // sine sample; the phase advances once per frame for a continuous tone.
    for (uint32_t f = 0u; f < frames; ++f)
    {
        const int32_t sample = s_sine_lut[(phase + f) & TDM_SMOKE_LUT_MASK];
        for (uint32_t k = 0u; k < slots; ++k)
        {
            dst[w] = sample;                       // TX: drive the slot
            const int32_t r = src[w] >> 16;        // RX: shift BEFORE squaring (overflow-safe)
            sumsq += (uint64_t)((int64_t)r * (int64_t)r);
            ++w;
        }
    }

    s_phase    = (phase + frames) & TDM_SMOKE_LUT_MASK;
    s_rx_sumsq = sumsq;       // per-block (not accumulated across blocks)
    s_rx_count = w;
}

//===========================================================
// Board/clock port: pins only (master-only demo). No external clock / CLC.
//===========================================================
static bool tdm_smoke_configure_pins(nora_spi_i2s_tdm_clock_role_t role)
{
    // This demo is master-only; reject any other role rather than silently mis-routing.
    // open() passes the committed primary leg's role here (MASTER for this smoke).
    if (role != NORA_SPI_I2S_TDM_CLOCK_MASTER)
    {
        return false;
    }
    return board_spi1_tdm_smoke_pins_init();
}

static const nora_spi_i2s_tdm_port_t s_tdm_smoke_port =
{
    .configure_pins      = tdm_smoke_configure_pins,
    .clc_passthrough     = NULL,    // no codec MCLK fan-out
    .clock_source_init   = NULL,    // self-clocked master: no external clock to bring up
    .clock_source_ready  = NULL,    // NULL => always ready (no clock gate)
    .consume_clock_event = NULL,
};

//===========================================================
// Init helpers
//===========================================================
static void tdm_smoke_build_sine(void)
{
    float ref_sumsq = 0.0f;
    for (uint32_t i = 0u; i < TDM_SMOKE_LUT_N; ++i)
    {
        const float ph = (2.0f * 3.14159265358979f * (float)i) / (float)TDM_SMOKE_LUT_N;
        const int32_t s = (int32_t)((float)TDM_SMOKE_AMPLITUDE * sinf(ph));
        s_sine_lut[i] = s;
        const float rs = (float)(s >> 16);         // same scaling the RX accumulator uses
        ref_sumsq += rs * rs;
    }
    s_tx_ref_meansq = ref_sumsq / (float)TDM_SMOKE_LUT_N;   // 0 dB reference (mean-square)
}

bool tdm_smoke_init(void)
{
    nora_spi_i2s_tdm_inst_t *inst;

    s_started    = false;
    s_paused_for_update = false;
    s_init_error = NORA_SPI_I2S_TDM_ERR_NONE;
    s_phase      = 0u;
    s_rx_sumsq   = 0u;
    s_rx_count   = 0u;

    tdm_smoke_build_sine();

    // Board/clock port (pin routing reached via the hook -- the HAL core stays board-free).
    // set_port() is a fail-closed bool API (rejects while opened/running); honour it rather than
    // continuing with an unbound port.
    if (!nora_spi_i2s_tdm_set_port(&s_tdm_smoke_port))
    {
        s_init_error = nora_spi_i2s_tdm_get_last_error();
        return false;
    }

    inst = nora_spi_i2s_tdm_spi1();
    if (inst == NULL)
    {
        s_init_error = nora_spi_i2s_tdm_get_last_error();
        return false;
    }

    // Callback must be registered before start().
    if (!nora_spi_i2s_tdm_set_block_callback(inst, tdm_smoke_block_cb, NULL))
    {
        s_init_error = nora_spi_i2s_tdm_get_last_error();
        return false;
    }

    // TDM self-clocked master config (TDM8 by default), expressed as a one-leg SYSTEM table
    // and applied via the public transactional path configure_system() -> open() ->
    // start_all_domains(). Geometry comes from the same conf.h constants that sized the HAL's
    // static DMA buffers; BRG sets the master BCLK from the system clock. Every stream field
    // is stated explicitly (no default builder + override).
    static const nora_spi_i2s_tdm_leg_setup_t s_tdm_system[] =
    {
        {
            .stream =
            {
                .format                        = NORA_SPI_I2S_TDM_FORMAT_TDM,
                .clock_role                    = NORA_SPI_I2S_TDM_CLOCK_MASTER,
                .slots_per_fs                  = (uint8_t)NORA_TDM_SLOTS_PER_FS,
                .word_bits                     = 32u,
#if APP_TDM_MASTER_FS50_BY_CLC10
                // 50%-duty FS: for this TDM8 master the HAL emits a half-frame marker and
                // engages CLC10 to toggle it into a ~50%-duty FS on the FS pin (HAL-internal).
                .fs_shape                      = NORA_SPI_I2S_TDM_FS_50PCT,
#else
                .fs_shape                      = NORA_SPI_I2S_TDM_FS_PULSE,  // short 1-BCLK frame sync
#endif
                .block_frames                  = (uint16_t)NORA_TDM_BLOCK_FRAMES,
                .brg                           = TDM_SMOKE_SPI_BRG,
                .mclk_enable                   = true,    // MCLKEN=1 (CLKGEN9 reference)
                .fs_coincides_first_bclk       = true,    // SPIFE=1 : no 1-bit delay (TDM8)
                .bclk_idle_high                = true,    // CKP=1
                .bclk_change_on_active_to_idle = false,   // CKE=0
            },
            .sync_domain = 0u,
        },
    };

    // The DMA HAL must be globally initialized before any channel config / start (start
    // arms the SPI1 RX/TX DMA). Only the TDM demo uses DMA on this board.
    nora_dma_global_init();

    // Transactional whole-system configure (one leg here). open() takes NO role -- it derives
    // the master role from this committed primary leg and passes it to the pin hook.
    if (!nora_spi_i2s_tdm_configure_system(
            s_tdm_system, (uint8_t)(sizeof(s_tdm_system) / sizeof(s_tdm_system[0]))))
    {
        s_init_error = nora_spi_i2s_tdm_get_last_error();
        return false;
    }
    if (!nora_spi_i2s_tdm_open())
    {
        s_init_error = nora_spi_i2s_tdm_get_last_error();
        return false;
    }
    // Start the sync domain: arms DMA + enables SPI1; the stream runs autonomously on DMA/ISR.
    // (For FS_50PCT the HAL engages CLC10 internally just before the module turns on.)
    if (!nora_spi_i2s_tdm_start_all_domains())
    {
        // Fail closed: the HAL rolls back the domains it started, but open() left the shared port
        // opened. Since close() now preserves the config mode and rejects while running (neither
        // applies here -- nothing is running), close() to release the open state; otherwise the
        // next tdm_smoke_init() would get ERR_ALREADY_OPEN from set_port()/configure_system().
        // Save the real error first (close() overwrites last-error on success).
        const nora_spi_i2s_tdm_error_t err = nora_spi_i2s_tdm_get_last_error();
        (void)nora_spi_i2s_tdm_close();
        s_init_error = err;
        return false;
    }

    s_started = true;

#if APP_TDM_MASTER_FS50_BY_CLC10
    printf(" [TDM1] FS shape: 50%% duty (HAL CLC10 generated) on the FS pin\n");
#else
    printf(" [TDM1] FS shape: short 1-BCLK frame sync\n");
#endif

#if (APP_TDM_MASTER_FS50_BY_CLC10 && APP_TDM_FS_RUNTIME_SWITCH_TEST)
    // Runtime FS-pin restore proof (opt-in): read back the external FS pin's PPS output code
    // (RP70 -> RPOR17.RP70R) across a start -> stop -> start cycle. With CLC10 engaged for
    // FS_50PCT the pin reads CLC10OUT (78); inst_stop() releases CLC10 and MUST restore the
    // pin to SS1 (27); the next start re-engages (78 again). Proves the release-restore path
    // that makes a runtime FS_50PCT -> stop -> FS_PULSE -> start switch correct.
    // Exercise the restart through the SYSTEM domain lifecycle (stop_all -> start_all_domains),
    // the same path the normal start uses, rather than the per-leg inst_stop/inst_start.
    printf(" [FS-SW] RP70R after FS_50PCT start = %u (expect 78=CLC10OUT)\n", (unsigned)RPOR17bits.RP70R);
    // stop_all_domains() is now a bool SYSTEM-mode API; this smoke is SYSTEM (configure_system),
    // so it returns true. Honour it: a failed stop is a failed self-test (fail closed).
    if (!nora_spi_i2s_tdm_stop_all_domains())
    {
        const nora_spi_i2s_tdm_error_t err = nora_spi_i2s_tdm_get_last_error();
        (void)nora_spi_i2s_tdm_close();
        s_init_error = err;
        s_started    = false;
        printf(" [FS-SW] stop FAILED: %s\n", tdm_smoke_last_error_str());
        return false;
    }
    printf(" [FS-SW] RP70R after stop(release)  = %u (expect 27=SS1 restored)\n", (unsigned)RPOR17bits.RP70R);
    if (!nora_spi_i2s_tdm_start_all_domains())
    {
        // Fail closed: a failed restart is NOT a successful init. Release the still-open port
        // (close() preserves config mode; nothing is running after a failed start) so a re-init
        // is not blocked by ERR_ALREADY_OPEN. Preserve the real error across close().
        const nora_spi_i2s_tdm_error_t err = nora_spi_i2s_tdm_get_last_error();
        (void)nora_spi_i2s_tdm_close();
        s_init_error = err;
        s_started    = false;
        printf(" [FS-SW] re-start FAILED: %s\n", tdm_smoke_last_error_str());
        return false;
    }
    printf(" [FS-SW] RP70R after re-start       = %u (expect 78=CLC10OUT)\n", (unsigned)RPOR17bits.RP70R);
#endif

    return true;
}

bool tdm_smoke_pause_for_update(void)
{
    if (s_paused_for_update || !s_started)
    {
        return true;
    }
    if (!nora_spi_i2s_tdm_stop_all_domains())
    {
        s_init_error = nora_spi_i2s_tdm_get_last_error();
        return false;
    }
    s_started = false;
    s_paused_for_update = true;
    s_init_error = NORA_SPI_I2S_TDM_ERR_NONE;
    return true;
}

bool tdm_smoke_resume_after_update_failure(void)
{
    if (!s_paused_for_update)
    {
        return true;
    }
    if (!nora_spi_i2s_tdm_start_all_domains())
    {
        s_init_error = nora_spi_i2s_tdm_get_last_error();
        return false;
    }
    s_started = true;
    s_paused_for_update = false;
    s_init_error = NORA_SPI_I2S_TDM_ERR_NONE;
    return true;
}

//===========================================================
// Status line (main-loop context) -- heavy math lives here
//===========================================================
void tdm_smoke_status_print(void)
{
    nora_spi_i2s_tdm_inst_t  *inst;
    nora_spi_i2s_tdm_status_t st;
    uint64_t sumsq;
    uint32_t cnt;
    float    rx_db = TDM_SMOKE_RX_FLOOR_DB;
    int32_t  db10, whole, frac;
    const char *sign;

    if (!s_started)
    {
        return;
    }

    inst = nora_spi_i2s_tdm_spi1();
    if ((inst == NULL) ||
        !nora_spi_i2s_tdm_inst_get_status(inst, &st, false))
    {
        return;
    }

    // Snapshot the callback's last-block accumulator. Non-atomic 64-bit read may tear on this
    // 16-bit core (display only; see the s_rx_sumsq declaration note) -- acceptable here.
    sumsq = s_rx_sumsq;
    cnt   = s_rx_count;
    if ((cnt > 0u) && (s_tx_ref_meansq > 0.0f))
    {
        const float rx_meansq = (float)sumsq / (float)cnt;
        if (rx_meansq > 0.0f)
        {
            rx_db = 10.0f * log10f(rx_meansq / s_tx_ref_meansq);
            if (rx_db < TDM_SMOKE_RX_FLOOR_DB)
            {
                rx_db = TDM_SMOKE_RX_FLOOR_DB;
            }
        }
    }

    // Format dB as a signed x.y without relying on %f (round to one decimal).
    db10  = (int32_t)((rx_db * 10.0f) + ((rx_db >= 0.0f) ? 0.5f : -0.5f));
    whole = db10 / 10;
    frac  = db10 % 10;
    if (frac < 0) { frac = -frac; }
    sign = ((db10 < 0) && (whole == 0)) ? "-" : "";   // preserve sign for -0.x

    printf(" [TDM1] TDM%lu master exp_fs~%lukHz exp_bclk~%lukHz block=%lu miss=%lu rx=%s%ld.%ld dB rel\n",
           (unsigned long)NORA_TDM_SLOTS_PER_FS,
           (unsigned long)(TDM_SMOKE_EXP_FS_HZ / 1000u),
           (unsigned long)(TDM_SMOKE_EXP_BCLK_HZ / 1000u),
           (unsigned long)st.block_count,
           (unsigned long)st.block_deadline_miss_count,
           sign, (long)whole, (long)frac);
}

const char *tdm_smoke_last_error_str(void)
{
    switch (s_init_error)
    {
        case NORA_SPI_I2S_TDM_ERR_NONE:               return "none";
        case NORA_SPI_I2S_TDM_ERR_BAD_INSTANCE:       return "bad-instance";
        case NORA_SPI_I2S_TDM_ERR_BAD_ARGUMENT:       return "bad-argument";
        case NORA_SPI_I2S_TDM_ERR_NOT_CONFIGURED:     return "not-configured";
        case NORA_SPI_I2S_TDM_ERR_ALREADY_RUNNING:    return "already-running";
        case NORA_SPI_I2S_TDM_ERR_UNSUPPORTED_CONFIG: return "unsupported-config";
        case NORA_SPI_I2S_TDM_ERR_TOPOLOGY:           return "topology";
        case NORA_SPI_I2S_TDM_ERR_CLOCK_INIT:         return "clock-init";
        case NORA_SPI_I2S_TDM_ERR_CLOCK_NOT_READY:    return "clock-not-ready";
        case NORA_SPI_I2S_TDM_ERR_PIN_CONFIG:         return "pin-config";
        case NORA_SPI_I2S_TDM_ERR_CLC:                return "clc";
        case NORA_SPI_I2S_TDM_ERR_DMA_CONFIG:         return "dma-config";
        case NORA_SPI_I2S_TDM_ERR_NOT_OPEN:           return "not-open";
        case NORA_SPI_I2S_TDM_ERR_ALREADY_OPEN:       return "already-open";
        case NORA_SPI_I2S_TDM_ERR_CONFIG_MODE:        return "config-mode";
        default:                                           return "unknown";
    }
}

#endif /* HAL_STARTER_ENABLE_TDM_SMOKE_DEMO */
